off-project-mod4/app/controllers/reviews_controller.rb

    def create
        review =  @current_user.reviews.create!(review_params)
---
INSERT INTO "reviews" ("title", "rating", "text_content", "user_id", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def current_users_reviews
        Review.all.filter{|r| user_id == current_user(:id)}
---
SELECT "reviews".* FROM "reviews"

    def destroy
        review = @current_user.reviews.find(params[:id])
        review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 2]]