off-project-mod4/app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
    def index
        topics = Topic.all

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        topic = Topic.find(params[:id])

INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Lightbulbs"], ["created_at", "2022-02-14 17:41:56.200591"], ["updated_at", "2022-02-14 17:41:56.200591"]]
INSERT INTO "reviews" ("title", "text_content", "user_id", "topic_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Squish"], ["text_content", "TTTT"], ["user_id", 1], ["topic_id", 2], ["created_at", "2022-02-16 21:31:49.434206"], ["updated_at", "2022-02-16 21:31:49.434206"]]
INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "TestTest"], ["created_at", "2022-02-16 22:01:58.689916"], ["updated_at", "2022-02-16 22:01:58.689916"]]
---
    def create
    topic = @current_user.topic.create!(topic_params)
    topic.reviews.create!(review_params)