off-project-mod4/app/serializers/user_serializer.rb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---
  def review_length
    object.reviews.count